[
  {
    "id": 1,
    "title": "Frankenstein’s Monster: The Original AGI Warning",
    "content": 
    "<h2> Inspiration </h2> <p> I recently watched Guillermo del Toro's [Frankenstein](https://www.imdb.com/title/tt1312221/). I have also read Mary Shelly's Frankenstein or the Modern Promethius, and revisiting the story through Guillermo del Toro's spin on it reignited my hot take that Frankenstein serves an evergreen allegory for innovation. One specific type of innovation that immediately comes to mind is [Artificial General Intelligence](https://en.wikipedia.org/wiki/Artificial_general_intelligence). <h2> Brief Summary of Frankenstein </h2> The novel Frankenstein follows the story of Dr. Victor Frankenstein and his invention he called the Creature.  Regardless of whatever his intentions were, Frankenstein had tunnel vision when it came to designing and creating the Creature. Only when he was done was when the ramifications of his obsessions came to light. Frankenstein like fully abandoned the creature to run away from those very ramifications. As a result, however, the Creature felt lost, confused, frustrated; he was brought into a world he not only didn’t ask for, he had no idea how to even start to navigate it, the one person who could guide him did everything he could to pretend the Creature wasn’t real. This converted the Creature’s frustration into rage, personal rage, rage that the Creature haunted Frankenstein every step of the way. <h2> Why it Connects with AGI </h2> Frankenstein’s tunnel vision was his own demise. There are countless pieces of media about robots taking over. Robots may be the closest comparison to the Creature – soulless, and fully relies on human guidance (the Creature was fully dependent on Frankenstein).  Though I don’t think the real world implications of advancements in Artificial Intelligence will exactly manifest like the horrific, revengeful dystopia of movies, they manifest in other ways such as deteriorating our critical thinking, throwing out any semblance of economic safety and security we have. And so, the purpose of this blog is to just explore the different ways Frankenstein draw on AGI, but even other innovations as well.",
    "author": "Mustjaab",
    "date": "2025-12-03",
    "excerpt": "Mary Shelley’s Frankenstein isn’t just a Gothic novel—it’s literature’s first and most enduring blueprint for the ethical catastrophe of unchecked innovation",
    "tags": [
      "Introduction",
      "Literature"
    ]
  }
]
